# Project: Building MySQL Database for VHS Rental Store | Cristiane Carneiro

## Data Cleaning : category.csv

In this file, one can review the step by step cleaning process for table category.csv

### Import

We start by importing the libraries we are going to use and loading the database

In [84]:
%pip install ipython
%pip install seaborn
%pip install mysql-connector-python
%pip install sqlalchemy
%pip install pymysql

Requirement already satisfied: ipython in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (8.16.1)
Requirement already satisfied: backcall in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.2.0)
Requirement already satisfied: decorator in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.19.1)
Requirement already satisfied: matplotlib-inline in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.1.6)
Requirement already satisfied: pickleshare in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (3.0.39)
Requirement already satisfied: pygments>=2.4.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (2.16.1)
Requirement already satisfied: stack-data in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.6.3)
Requirement already satisfied: traitlets>=5 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (5.11.2)
Requirement already satisfied: exceptiongroup in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (1.1.3)
Requirement already satisfied: pexpect>4.3 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (4.8.0)
Requirement already satisfied: appnope in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from ipython) (0.1.3)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from jedi>=0.16->ipython) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from pexpect>4.3->ipython) (0.7.0)
Requirement already satisfied: wcwidth in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30->ipython) (0.2.8)
Requirement already satisfied: executing>=1.2.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from stack-data->ipython) (2.0.0)
Requirement already satisfied: asttokens>=2.1.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from stack-data->ipython) (2.4.0)
Requirement already satisfied: pure-eval in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from stack-data->ipython) (0.2.2)
Requirement already satisfied: six>=1.12.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from asttokens>=2.1.0->stack-data->ipython) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (0.13.0)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from seaborn) (1.26.1)
Requirement already satisfied: pandas>=1.2 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from seaborn) (2.1.1)
Requirement already satisfied: matplotlib!=3.6.1,>=3.3 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from seaborn) (3.8.0)
Requirement already satisfied: contourpy>=1.0.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (1.1.1)
Requirement already satisfied: cycler>=0.10 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (4.43.1)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (1.4.5)
Requirement already satisfied: packaging>=20.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (23.2)
Requirement already satisfied: pillow>=6.2.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (10.1.0)
Requirement already satisfied: pyparsing>=2.3.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (3.1.1)
Requirement already satisfied: python-dateutil>=2.7 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.3->seaborn) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from pandas>=1.2->seaborn) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from pandas>=1.2->seaborn) (2023.3)
Requirement already satisfied: six>=1.5 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.3->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: mysql-connector-python in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (8.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from mysql-connector-python) (4.21.12)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: sqlalchemy in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (2.0.22)
Requirement already satisfied: typing-extensions>=4.2.0 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from sqlalchemy) (4.8.0)
Requirement already satisfied: greenlet!=0.4.17 in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (from sqlalchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pymysql in /Users/criscarneiro/anaconda3/envs/clase/lib/python3.10/site-packages (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [85]:
import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import warnings
warnings.filterwarnings('ignore')

import pylab as plt  

import seaborn as sns 

import mysql.connector as conn

from sqlalchemy import create_engine

%matplotlib inline

In [86]:
categories = pd.read_csv('/Users/criscarneiro/desktop/ironhack/6_Projects/sql-data-base-building/data/raw/category.csv')

In [87]:
categories.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

### Good practices

Some good practices before we continue with the exercise

In [88]:
#creating a back-up with the original table 

categoriesoriginal = categories.copy()

In [89]:
#ensuring column names are clean 

categories.columns

Index(['category_id', 'name', 'last_update'], dtype='object')

In [90]:
categories.columns = [c.lower().replace(' ', '_') for c in categories.columns]

categories.columns

Index(['category_id', 'name', 'last_update'], dtype='object')

In [91]:
#checking for duplicates 

categories.duplicated().any() #there are no duplicates

False

### Explore

Exploratory analysis to understand the data base (e.g,. description, column types, searching for null values)

In [92]:
#it seems we have a repository of movie categories with their respective IDs and the data in each it was updated. 

categories.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [93]:
#we have 3 columns, and 16 entries (rows) in our original database

categoriesoriginal.shape

(16, 3)

In [94]:
#here we can see the type of each of the columns
#it seems all values are non-null

categories.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

In [95]:
#description table
#here we can see the #of unique values, and the mode of each field. 
#it seems all categories names are unique 

categories.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
category_id,16.0,NaN,NaN,NaN,8.5,4.760952,1.0,4.75,8.5,12.25,16.0
name,16,16,Action,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
last_update,16,1,2006-02-15 04:46:27,16,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Null values

As stated above, there are no null values in the database. See per below:

In [96]:
#there are no null values in the database 

nan_cols = categories.isna().sum()

nan_cols

category_id    0
name           0
last_update    0
dtype: int64

### Other cleaning

#### category_id

In [97]:
#we got a list of int values, which seem to be IDs for the each category
#this is the most appropriate datatype (although we will optimize it later)

categories.category_id.dtype

dtype('int64')

In [98]:
#it seems all the IDs are unique values 

len(categories.category_id.unique())

16

In [99]:
categories.category_id.unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16])

#### last_update

In [100]:
#this column is type 'object'. It seems tough it would be most appropriate as a 'time type'

categories.last_update.dtype

dtype('O')

In [101]:
#all the values are the same, indicating all the names were last updated on Feb 15th 2006

categories.last_update.value_counts()

last_update
2006-02-15 04:46:27    16
Name: count, dtype: int64

In [102]:
#I will convert the data to datetime64

categories.last_update = pd.to_datetime(categories.last_update)

In [103]:
#converted 

categories.last_update.dtype

dtype('<M8[ns]')

#### name

In [104]:
#this column is type 'object'. It seems tough it would be most appropriate as a string 

categories.name.dtype

dtype('O')

In [105]:
#these are the categories
#all values are unique 

categories.name.value_counts()

name
Action         1
Animation      1
Children       1
Classics       1
Comedy         1
Documentary    1
Drama          1
Family         1
Foreign        1
Games          1
Horror         1
Music          1
New            1
Sci-Fi         1
Sports         1
Travel         1
Name: count, dtype: int64

In [106]:
categories.name.unique()

array(['Action', 'Animation', 'Children', 'Classics', 'Comedy',
       'Documentary', 'Drama', 'Family', 'Foreign', 'Games', 'Horror',
       'Music', 'New', 'Sci-Fi', 'Sports', 'Travel'], dtype=object)

In [107]:
#in case there are spaces 

categories.name = categories.name.apply(lambda X: X.title().replace(' ',''))

In [108]:
categories.head()

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27
2            3   Children 2006-02-15 04:46:27
3            4   Classics 2006-02-15 04:46:27
4            5     Comedy 2006-02-15 04:46:27

### Column names and duplicates

In [109]:
categories.columns

Index(['category_id', 'name', 'last_update'], dtype='object')

In [110]:
#renaming last_update to distinguish from other tables

newcolumns = ['category_id', 'category_name', 'category_last_update']

In [111]:
categories.columns = newcolumns

In [112]:
#checking for duplicates 

categories.duplicated().any() #there are no duplicates

False

In [113]:
categories.head(2)

   category_id category_name category_last_update
0            1        Action  2006-02-15 04:46:27
1            2     Animation  2006-02-15 04:46:27

### Category Unknown

Based on the other databased found, certain film titles are not classified into categories. Therefore, I will add a category named 'Unknown', with id = 99

In [114]:
from datetime import datetime

In [115]:
new_category_id = 99
new_category_name = 'Unknown'

current_date_time = datetime.now().strftime('%Y-%m-%d %H:%M:%S')

new_line = {'category_id': new_category_id, 'category_name': new_category_name, 'category_last_update': current_date_time}
categories = pd.concat([categories, pd.DataFrame(new_line, index=[0])], ignore_index=True)

In [116]:
categories.tail(5)

    category_id category_name category_last_update
12           13           New  2006-02-15 04:46:27
13           14        Sci-Fi  2006-02-15 04:46:27
14           15        Sports  2006-02-15 04:46:27
15           16        Travel  2006-02-15 04:46:27
16           99       Unknown  2023-10-30 16:14:47

### Column types and optimization

I will optimize the database for memory

In [117]:
categories.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   category_id           17 non-null     int64
 1   category_name         17 non-null     object
 2   category_last_update  17 non-null     object
dtypes: int64(1), object(2)
memory usage: 3.4 KB

In [118]:
#downcast category_id

categories.category_id = pd.to_numeric(categories.category_id, downcast='integer')

In [119]:
#name column to 'category'

for c in categories.select_dtypes(include='object'):
    
    categories[c] = categories[c].astype('category')

In [120]:
#no need for 'nanoseconds' precision

categories.last_update = categories.category_last_update.astype('datetime64[s]')

### Comparison output

In [121]:
#no values eliminated 

print(categoriesoriginal.shape)
print(categories.shape)

(16, 3)
(17, 3)

In [122]:
#1.8KB vs 2.4KB

categories.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   category_id           17 non-null     int8
 1   category_name         17 non-null     category
 2   category_last_update  17 non-null     category
dtypes: category(2), int8(1)
memory usage: 2.1 KB

In [123]:
categoriesoriginal.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

### Export clean table

In [124]:
categories.to_csv('/Users/criscarneiro/desktop/ironhack/6_Projects/sql-data-base-building/data/clean/category_clean.csv', index=False)

### Export to MYSQL

In [125]:
with open('/Users/criscarneiro/desktop/ironhack/6_Projects/sql-data-base-building/pw.txt') as file: 
    
    password = file.read()

In [126]:
str_conn=f'mysql+pymysql://root:{password}@localhost:3306/rentalstore'

cursor = create_engine(str_conn)

In [127]:
categories.to_sql(name='categories',
              con=cursor,
              if_exists = 'replace',
              index=True)

17